back-end/app/controllers/api/artists_controller.rb

  def index
    @artists = Artist.all
---
SELECT "artists".* FROM "artists"

  def create
    @artist = Artist.new(artist_params)
      if @artist.save
---
INSERT INTO "artists" ("name", "bio", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "test artist"], ["bio", "test info"], ["created_at", "2015-07-17 04:20:50.347373"], ["updated_at", "2015-07-17 04:20:50.347373"]]