back-end/app/controllers/api/genres_controller.rb

SELECT "genres".* FROM "genres"
---
  def index
    @genres = Genre.all

INSERT INTO "genres" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "test genre"], ["created_at", "2015-07-17 04:39:58.547386"], ["updated_at", "2015-07-17 04:39:58.547386"]]
---
  def create
    @genre = Genre.new(genre_params)
      if @genre.save