back-end/app/controllers/api/songs_controller.rb

  def index
    @songs = Song.all
---
SELECT "songs".* FROM "songs"

  def create
    @song = Song.new(song_params)
      if @song.save
---
INSERT INTO "songs" ("title", "duration", "album", "url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "test"], ["duration", 130], ["album", "test album"], ["url", "www.google.com"], ["created_at", "2015-07-17 03:01:32.157357"], ["updated_at", "2015-07-17 03:01:32.157357"]]

  def show
    @song = Song.find(params[:id])
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT 1  [["id", 980190962]]

  def update
    @song = Song.find(params[:id])
      if @song.update_attributes(song_params)
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT 1  [["id", 980190962]]
UPDATE "songs" SET "title" = $1, "duration" = $2, "url" = $3, "album" = $4, "artist" = $5, "genre" = $6, "updated_at" = $7 WHERE "songs"."id" = $8  [["title", "test"], ["duration", 130], ["url", "www.google.com"], ["album", "test album"], ["artist", "test artist1"], ["genre", 0], ["updated_at", "2015-07-17 15:21:20.423683"], ["id", 980190962]]

  def destroy
    @song = Song.find(params[:id])
    @song.destroy
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT 1  [["id", 980190962]]
DELETE FROM "songs" WHERE "songs"."id" = $1  [["id", 980190962]]